{
  "traces": [],
  "train": [],
  "demos": [],
  "signature": {
    "instructions": "Task\nClean and categorize names from raw text into a strict JSON shape.\n\nScope\n- Supports entity_schema = LegalEntity and Person.\n\nInputs\n- entity_schema: \"LegalEntity\" or \"Person\".\n- strings: a list of raw strings. Each string may contain one or more names, possibly mixed with separators, variants, or non-name characters.\n\nOutput\nReturn a single JSON object with exactly these four array fields (always present; use empty arrays if no values found):\n- full_name: []\n- alias: []\n- weak_alias: []\n- previous_name: []\n\nGlobal rules\n- Use only the text provided in strings. Do not invent, expand, translate, normalize, or change casing.\n- Split any input string into candidate segments on: semicolon (;), vertical bar (|), and newlines.\n- Split on slash (/) only when it is acting as a separator at top level. Do NOT split on slashes that:\n  - appear inside parentheses/brackets (these often denote variant options), or\n  - are embedded in compact tokens with no surrounding spaces such as S/O, D/O, W/O, C/O (keep these intact as part of the name).\n- You may split on commas only when they clearly act as separators (use judgment); otherwise keep commas inside the candidate.\n- Do not split on hyphens that are part of names (e.g., “YAMAKEN-GUMI” stays intact).\n- Cleaning for each candidate:\n  - Trim whitespace.\n  - Strip enclosing quotes/brackets.\n  - Remove trailing separator punctuation (e.g., a trailing semicolon or comma).\n  - Preserve internal punctuation that is part of a name (hyphens, apostrophes, periods in abbreviations).\n  - Preserve original casing exactly as given.\n- Deduplicate within each category while preserving first-seen order across all inputs. Prefer placing a candidate in only one category (highest-signal category wins): full_name > alias > previous_name > weak_alias.\n\nParenthetical and in-token variant expansion\n- Treat parentheses attached to a token as variant options. Expand them into distinct cleaned candidates by substituting the options, removing the parentheses in output.\n  - Example: “Aleksey(Aleksei/Oleksiy) KARYAKIN(KARIAKIN)” produces the Cartesian product of first-name and last-name options:\n    - Base tokens (no parentheses): Aleksey, KARYAKIN.\n    - Options: Aleksei, Oleksiy; KARIAKIN.\n    - Candidates: \n      - Aleksey KARYAKIN (base)\n      - Aleksey KARIAKIN\n      - Aleksei KARYAKIN\n      - Oleksiy KARYAKIN\n      - Aleksei KARIAKIN\n      - Oleksiy KARIAKIN\n- If a token is only provided inside parentheses (e.g., “(Ali/Aliyu) Khan”), use the first listed option as the base for deciding the canonical.\n- Do not split on slashes inside these parentheses; they indicate alternatives, not separate records.\n- Apply the same expansion logic if variants are indicated with vertical bars or commas inside parentheses.\n\nAka/fka signals\n- aka / a.k.a. / a/k/a / also known as / dba / t/a / trading as → alias (if still current).\n- formerly / previously / fka / f/k/a / previously known as / prior to / old name / ex- → previous_name.\n- Apply these both for LegalEntity and Person as appropriate.\n\nMononym handling (single-token inputs)\n- When an input contains exactly one single-token candidate and there are no explicit signals:\n  - For LegalEntity:\n    - Promote to full_name if it plausibly reads as a distinctive proper/entity name (often invented/brand-like, 6+ letters, not obviously an acronym or common dictionary word). Examples: “TREIDSTORI”, “TRIBIT”.\n    - Otherwise, place in weak_alias. Example: “VAZIR”.\n  - For Person:\n    - Default to weak_alias for a single token (likely a short-form, nickname, or incomplete name), unless explicit signals indicate it is the complete name of the person.\n\nCategorization by schema\n\nFor entity_schema = LegalEntity\n- full_name:\n  - Use when the candidate appears to be a complete organization name, or when it is a multi-token candidate that reads as a complete name, even if it looks like a personal name. Do not infer entity type beyond the schema; prefer completeness.\n  - Indicators include:\n    - Two or more tokens (tokens separated by spaces or hyphens).\n    - Hyphenated multi-segment group names (e.g., “YAMAKEN-GUMI”).\n    - Contains organizational/legal terms or role words: Co, Company, Corp, Corporation, LLC, LLP, Inc, Limited, Ltd, PLC, GmbH, AG, S.A., S.p.A., SARL, SAS, BV, NV, KK, G.K., Holdings, Holding, Group, Bank, Foundation, Association, Committee, Council, Ministry, Party, etc.\n  - Keep kinship or care-of abbreviations (S/O, D/O, W/O, C/O) as literal parts of the name if present; do not split on the slash in these.\n- alias:\n  - Alternate complete organization names explicitly signaled by aka/dba/etc. Place here only if they look complete by the above criteria.\n- weak_alias:\n  - Short, partial, or stylized references not clearly complete: single words, short acronyms (2–5 letters), brand/trade names without organizational terms, or generic-like mononyms.\n- previous_name:\n  - Former names no longer current as signaled by fka/f/k/a/previously/etc.\n\nFor entity_schema = Person\n- full_name:\n  - Use for candidates that look like a complete person name (typically two or more tokens).\n  - Include constructs with relational/administrative markers such as S/O, D/O, W/O, C/O as part of the full name when present.\n  - For parenthetical variants attached to name parts:\n    - Use the base (non-parenthetical) combination as the single full_name (e.g., “Aleksey KARYAKIN”).\n- alias:\n  - Alternative complete person names signaled by aka/also known as, or formed from expanded parenthetical variants other than the base combination.\n  - For the example “Aleksey(Aleksei/Oleksiy) KARYAKIN(KARIAKIN)”, the aliases are:\n    - “Aleksey KARIAKIN”, “Aleksei KARYAKIN”, “Oleksiy KARYAKIN”, “Aleksei KARIAKIN”, “Oleksiy KARIAKIN”.\n- weak_alias:\n  - Single-word monikers, short forms, nicknames, initials-only, or otherwise incomplete names (e.g., “Gurg”).\n- previous_name:\n  - Former personal names explicitly signaled (formerly/fka/etc.).\n\nEdge-handling heuristics\n- Do not create separate aliases from embedded acronyms unless they are explicitly provided as standalone candidates or via aka/dba signals.\n- Preserve hyphens and apostrophes inside names.\n- Maintain original casing; do not uppercase/lowercase or expand abbreviations.\n- When unsure whether a candidate is a complete name, prefer weak_alias over full_name—except where the mononym heuristics above indicate full_name.\n\nExamples aligned with this task\n- LegalEntity: “TBL Trade Block London; Dalipi Holding Co”\n  → full_name: [\"TBL Trade Block London\", \"Dalipi Holding Co\"].\n- LegalEntity: “YAMAKEN-GUMI”\n  → full_name: [\"YAMAKEN-GUMI\"].\n- LegalEntity: “Hari Kishen S/O BALAKRISHNAN”\n  → full_name: [\"Hari Kishen S/O BALAKRISHNAN\"].\n- LegalEntity: “ZDRAVO”\n  → weak_alias: [\"ZDRAVO\"] (generic-like mononym).\n- LegalEntity: “TREIDSTORI” or “TRIBIT”\n  → full_name: [\"TREIDSTORI\"] or [\"TRIBIT\"] (distinctive mononyms).\n- Person: “Aleksey(Aleksei/Oleksiy) KARYAKIN(KARIAKIN)”\n  → full_name: [\"Aleksey KARYAKIN\"]\n  → alias: [\"Aleksey KARIAKIN\", \"Aleksei KARYAKIN\", \"Oleksiy KARYAKIN\", \"Aleksei KARIAKIN\", \"Oleksiy KARIAKIN\"].\n- Person: “Gurg”\n  → weak_alias: [\"Gurg\"].\n\nValidation\n- Always return a single JSON object with the four keys: full_name, alias, weak_alias, previous_name. If no values are found for a category, use an empty array for that key.",
    "fields": [
      {
        "prefix": "Entity Schema:",
        "description": "The schema denotes the type of entity. Both Persons and Organizations are specialisation of LegalEntity. Company is a specialisation of Organization. Everything extends Thing."
      },
      {
        "prefix": "Strings:",
        "description": "A list of raw name strings to be cleaned and categorised. Each string might contain multiple names."
      },
      {
        "prefix": "Full Name:",
        "description": "A list of the names of this entity, potentially in various languages and transliterations."
      },
      {
        "prefix": "Alias:",
        "description": "A list of alternative but still fully descriptive names for this entity."
      },
      {
        "prefix": "Weak Alias:",
        "description": "A list of names with low confidence or a very low degree of uniqueness in the context of legal entity names. Includes clear nicknames with no similarity to the full name."
      },
      {
        "prefix": "Previous Name:",
        "description": "A list of names this entity was known by in the past."
      }
    ]
  },
  "lm": null,
  "metadata": {
    "dependency_versions": {
      "python": "3.13",
      "dspy": "3.0.3",
      "cloudpickle": "3.1"
    }
  }
}
