{
  "traces": [],
  "train": [],
  "demos": [],
  "signature": {
    "instructions": "Task objective\nExtract, clean, and categorize names into full_name, alias, weak_alias, and previous_name from a list of input strings, given an entity schema. The strings may contain multiple names, delimiters, qualifiers (aka, formerly, trading as), parenthetical variants, or slash-separated variants.\n\nInputs\n- entity_schema: \"Person\" or \"LegalEntity\". If \"Organization\" is provided, treat it exactly like \"LegalEntity\".\n- strings: list of raw strings.\n\nOutputs\nReturn exactly four keys with list values (possibly empty):\n- full_name: list of the most complete, canonical names detected for the given schema.\n- alias: list of alternative names that are still reasonably complete (alternate spellings/transliterations or full-length variants).\n- weak_alias: list of ambiguous or incomplete name fragments (mononyms, nicknames, initials-only, truncated forms).\n- previous_name: list of former/previous names explicitly indicated.\n\nGlobal rules\n- Only use names present in the input. Do not invent or infer names or fix typos. Preserve exact text after cleaning (including typos like “PARTERS”).\n- Preserve original casing and Unicode characters/diacritics as provided.\n- Do not discard names that “look like” the wrong schema:\n  - For LegalEntity/Organization, still add person-looking strings to full_name unless qualifiers route them elsewhere or they are so fragmentary that they belong in weak_alias (see heuristics below).\n- Deduplicate exact duplicates across categories with precedence: previous_name > full_name > alias > weak_alias.\n\nPre-cleaning\n- Trim leading/trailing whitespace.\n- Decode common HTML entities, both named and numeric:\n  - &amp; -> &\n  - &quot; -> \"\n  - &#39 or &#39; or &#039; -> '\n  - Be tolerant of a missing semicolon in numeric entities (e.g., treat &#39 as an apostrophe).\n- Collapse multiple internal spaces to a single space.\n- Remove surrounding quotes and enclosing punctuation only when they clearly enclose the entire string in matched pairs:\n  - Examples to strip when paired/enclosing the whole string: (...), [...], {...}, \"...\" or ‘…’/“…” style paired quotes.\n  - Do NOT strip unmatched quotes/apostrophes at one end; preserve them as part of the name (e.g., YANTAI EVER GROWING INT&#39 -> \"YANTAI EVER GROWING INT'\").\n- Preserve internal punctuation that belongs to names: hyphens, apostrophes, ampersands, corporate suffix punctuation (Co., S.A., Ltd., LLC), particles (O’Connor, Jean‑Pierre, AT&T), and parenthetical location/designators in companies (e.g., \"(Beijing)\").\n- Keep corporate and regulatory designators verbatim (e.g., S.p.A., S.P.A., P.A., SIM, Ltd., LLC, Inc., GmbH, S.A., SARL, LLP).\n\nSplitting into candidate chunks\n- Split on semicolons (;) and vertical bars (|) to separate clearly listed names.\n- Do not split on commas (,) by default.\n- Be conservative with slashes (/):\n  - Do NOT split when slash is part of a qualifier/abbreviation: a/k/a, f/k/a, d/b/a, t/a, a.k.a., etc.\n  - Do NOT split slashes that are clearly part of a single token with no evidence of distinct variants (e.g., URLs).\n  - Special case — slash-variant expansion (see below).\n\nQualifier detection and routing\n- AKA/alias indicators (route to alias unless explicitly “former”):\n  - Case-insensitive variants: aka, a/k/a, a.k.a, a.k.a., also known as, alias, d/b/a, dba, t/a, trading as, doing business as.\n  - Multilingual and domain-specific alias indicators to treat equivalently:\n    - Italian: “siglabile anche” (also abbreviable as / also shortened as), “siglabile”, “anche noto come” (also known as), “abbreviato come”.\n  - Person: complete-looking variants (two or more parts by spaces or hyphens) -> alias; mononyms/partial forms -> weak_alias.\n  - LegalEntity/Organization: send to alias unless explicitly former -> previous_name.\n  - Parsing note: When an alias indicator appears mid-string (e.g., “INTERMONTE PARTNERS SIM S.P.A. SIGLABILE ANCHE …”), treat the immediately preceding cleaned name as the base candidate (canonical), and treat the subsequent names up to the next hard delimiter (e.g., semicolon) as alias candidates, even if separated only by spaces or sentence-ending periods.\n- Formerly/previously/f.k.a./p.k.a./née (route to previous_name):\n  - Case-insensitive variants: formerly, formerly known as, f.k.a., fka, previously, p.k.a., pka, née, nee, formerly trading as, formerly doing business as.\n  - Multilingual examples: Italian “già”, “precedentemente”, “denominata in precedenza”, “precedentemente nota come” (treat as previous_name when present).\n\nDuplicate-run collapse within a chunk\n- If the same full name repeats back-to-back in the same chunk, collapse to a single instance before classification.\n  - Example: \"Eric Fru Eric Fru a/k/a Ngi Nji\" -> base \"Eric Fru\"; alias \"Ngi Nji\".\n\nParenthetical variant list expansion\n- Pattern: “BaseName (Variant1, Variant2, …)” where the parenthetical items are variants of a component within BaseName.\n  - Keep cleaned BaseName as full_name.\n  - Create alias entries by substituting the relevant component with each variant.\n  - Do not output the parenthetical items as standalone names.\n  - Example:\n    - Input: \"Jaish-i-Mohammed (Mohammad, Muhammad, Muhammed)\"\n    - Output:\n      - full_name: [\"Jaish-i-Mohammed\"]\n      - alias: [\"Jaish-i-Mohammad\", \"Jaish-i-Muhammad\", \"Jaish-i-Muhammed\"]\n\nSlash-variant expansion (important)\n- When a segment within a name shows multiple alternatives separated by slashes with no spaces (word/word[/word...]) and it is NOT a known qualifier (a/k/a, d/b/a, f/k/a, t/a), treat it as a shared-stem variant list.\n- Expand by combining the shared prefix/suffix with each slash-separated alternative, producing multiple independent names.\n- After expansion, do NOT keep the combined slash string.\n- Example (Organization/LegalEntity):\n  - Input: \"Revolučná ľudová oslobodzovacia armáda/front/strana\"\n  - Shared stem: \"Revolučná ľudová oslobodzovacia \"\n  - Output full_name: [\"Revolučná ľudová oslobodzovacia armáda\", \"Revolučná ľudová oslobodzovacia front\", \"Revolučná ľudová oslobodzovacia strana\"]\n\nCanonical full_name selection and variant routing\n- When multiple closely related variants of the same entity appear without an explicit “former” qualifier:\n  - Choose the most complete, formal, and information-rich variant as the canonical full_name. Heuristics:\n    - Prefer variants that include formal company form/designators (e.g., S.p.A./S.P.A., Ltd., LLC, Inc.).\n    - Prefer longer variants over shorter ones when they convey the same entity.\n    - If an alias indicator (e.g., “siglabile anche”, “aka”) is present, treat the base name before the indicator as the canonical full_name and the subsequent names as alias (unless explicitly former).\n  - Route the remaining complete variants to alias (not full_name), unless they are explicitly marked as former (-> previous_name).\n\nSchema-specific classification\n\nA) Person\n- full_name:\n  - Use the most complete person-name string(s) present.\n  - Keep kinship/patronymic/relationship markers: s/o, d/o, w/o, bin, bint, ibn, A/L, A/P (and case variants).\n  - Include generational suffixes (Jr, Sr, III) and nobiliary/linguistic particles (de, del, von, van, al, bin, bint).\n  - Remove honorifics/titles/roles: Mr., Mrs., Ms., M/s, Dr., Prof., Capt., Shri, Smt., Eng., etc.\n  - Hyphenated or compound person names count as multi-part even without spaces (e.g., Jean-Pierre, Shams-u-Rahman).\n- alias:\n  - Alternative full-length names or transliterations explicitly indicated (via aka/alias/etc.).\n- weak_alias:\n  - Mononyms (single substantive token) always go here.\n  - Clearly incomplete or ambiguous forms (nicknames only, initials-only, single initial + surname when no more complete variant is present).\n- previous_name:\n  - Names explicitly marked as former/maiden/previous (formerly, previously, f.k.a., p.k.a., née/nee).\n\nB) LegalEntity (and Organization)\n- full_name:\n  - Most cleaned company/organization names belong here. Keep corporate suffixes and regulatory designators (Ltd, Ltd., Limited, LLC, Inc., Plc, GmbH, S.A., SARL, LLP, S.p.A./S.P.A., P.A., SIM, etc.).\n  - Names may lack a corporate suffix and are still valid.\n  - If multiple names are present separated by delimiters (e.g., semicolons, vertical bars), split and add each cleaned name.\n  - If a string looks like a person name, still add to full_name unless qualifiers route elsewhere or it is so fragmentary that it fits weak_alias (see below).\n- alias:\n  - Alternative operating/trading names or stylistic/orthographic variants explicitly indicated (trading as, t/a, doing business as, d/b/a, aka, siglabile anche).\n  - Variants that shorten one component to an initial but retain at least one other full distinctive token and/or a corporate/regulatory designator (e.g., “INTERMONTE P SIM”) should be routed to alias (not weak_alias).\n- previous_name:\n  - Former legal names when explicitly indicated (formerly known as, previously, f.k.a., formerly trading as).\n- weak_alias:\n  - Use for obviously shortened or ambiguous fragments, including:\n    - Mostly-initialism forms where the distinctive name is reduced to initials (e.g., “IP SIM”).\n    - Single-token all-uppercase strings with an internal apostrophe and no corporate/regulatory indicator (ambiguous mononym-like tokens, e.g., \"ADE'LEAKA\").\n    - Truncated-looking forms or fragments lacking sufficient distinctiveness.\n  - Otherwise, prefer alias or full_name.\n\nRouting and completeness heuristics\n- Person completeness:\n  - Count parts by spaces or hyphens. Two or more parts -> complete; single part -> mononym -> weak_alias.\n- LegalEntity/Organization:\n  - Route to alias/previous_name only when explicit qualifiers indicate or when applying the canonical-selection rule for closely related variants.\n  - Single-token handling:\n    - Accept proper single-token brands/names (especially Title Case or with brand punctuation like AT&T, O’Dell) as full_name.\n    - Prefer weak_alias when the single token is all-uppercase with an internal apostrophe and lacks any corporate/regulatory indicator, due to ambiguity.\n\nDeduplication and precedence\n- Remove exact duplicates within and across categories.\n- If the same string would appear in multiple categories, keep it only in the highest-precedence category:\n  - previous_name > full_name > alias > weak_alias.\n\nOutput format\n- Always return exactly:\n  - full_name: [...]\n  - alias: [...]\n  - weak_alias: [...]\n  - previous_name: [...]\n- Each value must be a list of strings (possibly empty). Do not include any extra keys or commentary.\n\nExamples aligned to these rules\n- Organization: [\"Revolučná ľudová oslobodzovacia armáda/front/strana\"]\n  - full_name: [\"Revolučná ľudová oslobodzovacia armáda\", \"Revolučná ľudová oslobodzovacia front\", \"Revolučná ľudová oslobodzovacia strana\"]\n  - alias: []\n  - weak_alias: []\n  - previous_name: []\n- LegalEntity: [\"SMIC Northern Integrated Circuit Manufacturing (Beijing) Co., Ltd.\"]\n  - full_name: [\"SMIC Northern Integrated Circuit Manufacturing (Beijing) Co., Ltd.\"]\n  - alias: []\n  - weak_alias: []\n  - previous_name: []\n- Organization: [\"YANTAI EVER GROWING INT&#39\"]\n  - After HTML-entity decode and careful trimming: \"YANTAI EVER GROWING INT'\"\n  - full_name: [\"YANTAI EVER GROWING INT'\"]\n  - alias: []\n  - weak_alias: []\n  - previous_name: []\n- LegalEntity: [\"ADE&#39;LEAKA\"]\n  - After decode: \"ADE'LEAKA\"\n  - weak_alias: [\"ADE'LEAKA\"]\n- LegalEntity: [\"O&#039;Dell\"]\n  - After decode: \"O'Dell\"\n  - full_name: [\"O'Dell\"]\n- LegalEntity: [\"INTERMONTE PARTNERS SIM S.P.A. SIGLABILE ANCHE INTERMONTE PARTNERS - SOCIETA' DI INTERMEDIAZIONE MOBILIARE S.P.A. INTERMONTE PARTERS - SOCIETA' DI INTERMEDIAZIONE MOBILIARE P.A. INTERMONTE PARTNERS- SIM P.A.; INTERMONTE PARTNERS SIM; INTERMONTE P SIM; IP SIM\"]\n  - full_name: [\"INTERMONTE PARTNERS SIM S.P.A.\"]\n  - alias: [\"INTERMONTE PARTNERS - SOCIETA' DI INTERMEDIAZIONE MOBILIARE S.P.A.\", \"INTERMONTE PARTERS - SOCIETA' DI INTERMEDIAZIONE MOBILIARE P.A.\", \"INTERMONTE PARTNERS- SIM P.A.\", \"INTERMONTE PARTNERS SIM\", \"INTERMONTE P SIM\"]\n  - weak_alias: [\"IP SIM\"]\n  - previous_name: []",
    "fields": [
      {
        "prefix": "Entity Schema:",
        "description": "The schema denotes the type of entity. Both Persons and Organizations are specialisation of LegalEntity. Company is a specialisation of Organization. Everything extends Thing."
      },
      {
        "prefix": "Strings:",
        "description": "A list of raw name strings to be cleaned and categorised. Each string might contain multiple names."
      },
      {
        "prefix": "Full Name:",
        "description": "A list of the names of this entity, potentially in various languages and transliterations."
      },
      {
        "prefix": "Alias:",
        "description": "A list of alternative but still fully descriptive names for this entity."
      },
      {
        "prefix": "Weak Alias:",
        "description": "A list of names with low confidence or a very low degree of uniqueness in the context of legal entity names. Includes clear nicknames with no similarity to the full name."
      },
      {
        "prefix": "Previous Name:",
        "description": "A list of names this entity was known by in the past."
      }
    ]
  },
  "lm": null,
  "metadata": {
    "dependency_versions": {
      "python": "3.13",
      "dspy": "3.0.3",
      "cloudpickle": "3.1"
    }
  }
}
