{
  "traces": [],
  "train": [],
  "demos": [],
  "signature": {
    "instructions": "Goal\nExtract and categorize entity names (legal entities and persons) from input strings, cleaning out non-name metadata while preserving the original form and order of each name.\n\nInputs\n- strings: list of one or more raw strings (each may contain one or more names plus metadata).\n- entity_schema: one of Person, LegalEntity, Organization, Company. Treat Organization and Company as LegalEntity. Regardless of schema, if a string clearly contains a valid name (legal entity or person), extract it as a full_name according to the rules.\n\nOutput\n- Return only a JSON-like object with exactly these four keys, each mapping to a list of strings:\n  - full_name: []\n  - alias: []\n  - weak_alias: []\n  - previous_name: []\n- Always include all four keys; use empty lists when no items apply.\n- Preserve the input order of names when populating lists.\n- Deduplicate case-insensitively across and within all fields; if the same string could be both a full_name and an alias, keep it only as full_name. Preserve the first-seen original form.\n- Do not add any commentary or extra keys.\n\nPreprocessing and preservation\n- Decode common HTML entities before processing; preserve decoded characters in output:\n  - &#39; → ', &amp; → &, &quot; → \", &apos; → '\n- Normalize whitespace: collapse multiple spaces to one; trim leading/trailing spaces.\n- “Cleaned of non-name characters” means removing only separators and descriptive labels (e.g., leading numbering like “1) ”, bullets, semicolons used as delimiters, enclosing parentheses that introduce metadata, words like “formerly/aka/dba/t/a”), not punctuation that belongs to the name.\n- Preserve original text exactly for each extracted name after decoding: keep casing, diacritics, internal punctuation, apostrophes, ampersands, hyphens, commas, periods, and paired quotes that are part of the presented/registered style.\n- Keep leading articles (e.g., “The”) if present in the name.\n- Do not invent names not present in the input.\n\nHow to split inputs into candidate parts\n- Split on strong separators that typically delimit distinct names: semicolons (;), vertical bars (|), and slashes (/), but only when these separators are outside quotes or parentheses.\n- Do NOT split on commas—they are often part of names (e.g., “Co., Ltd.”).\n- Do NOT split on slashes when they are part of common tokens:\n  - Relationship markers: S/O, s/o, D/O, d/o, W/O, w/o, A/L, a/l, A/P, a/p, BIN, bin, BINTI, binti.\n  - Alias/previous markers: a/k/a, aka, a.k.a., d/b/a, dba, t/a, f/k/a, fka.\n  - Single clear tokens (codes/abbreviations).\n- After splitting, trim whitespace for each candidate part.\n- If multiple semicolon-separated formal variants are present and are not introduced by aka/dba/fka labels, treat each as a standalone candidate name (likely full_name).\n\nRemoving appended descriptive clauses\n- If a main name is followed by descriptive clauses starting with “including”, “this includes”, “as well as”, “comprising”, “consisting of”, “and all …”, “wherever located”, “all addresses …” (often after a comma), remove that clause and do not extract items within it as names or aliases.\n  - Example: “The Ministry of Defence of the Republic of Belarus, including the Armed Forces of Belarus …” =>\n    - Extract only “The Ministry of Defence of the Republic of Belarus” as full_name.\n\nHandling parentheses and quotes\n- Keep paired quotes that enclose the entity’s chosen name following a legal form (e.g., JSC \"Belgorodsocbank\", Zakrytoe Aktsionernoe Obshchestvo 'IFD Kapital'). Do not extract the inner quoted word as a separate alias unless it is also presented separately as its own name.\n- Parentheses that introduce metadata like “formerly/previously/fka/aka/dba/trading as” should be removed, and their inner content routed to previous_name or alias accordingly (see classification rules).\n- Parentheses that are clearly non-name descriptors (e.g., country/city) should generally be removed, unless they appear integral to the registered style (e.g., “Holdings (International) Limited”). When uncertain, prefer keeping parentheses content if it appears embedded within the official name rather than appended as a descriptor.\n\nSpecial handling: Inline alternates in parentheses (critical)\n- Pattern: A name token immediately followed by parentheses with no preceding space, containing unlabelled alternate spellings/transliterations, often separated by slashes.\n  - Examples: “Aleksandr(Oleksandr)”, “KHODAKOVSKY(KHODAKOVSKYY/KHODAKOVSKII)”, “Igor(Ihor)”.\n- Interpretation:\n  - These are inline alternates of the token itself, not metadata labels.\n  - For person names, treat the non-parenthetical tokens as the base form; treat any alternates inside such parentheses as alias components.\n  - Do NOT output any bare partial tokens (e.g., just “KHODAKOVSKYY”) on their own.\n- Expansion algorithm for person names:\n  1) Identify tokens with inline alternates: each such token yields an ordered list [base, alt1, alt2, …] where base is the literal outside parentheses, followed by the variants in listed order inside parentheses.\n  2) Construct the base full_name by concatenating only the base option for each token.\n  3) Construct alias permutations by replacing one or more tokens with their alternate options, generating combinations in a stable, readable order:\n     - First, vary a single token at a time in reading order:\n       a) Substitute alternate(s) for the first token while keeping others at base.\n       b) Then substitute alternate(s) for the second token while others at base, etc.\n     - Next, generate cross-combinations where two or more tokens are simultaneously replaced by their alternates.\n  4) Do not generate aliases that are identical to the base full_name.\n  5) Deduplicate case-insensitively; preserve first-seen original forms.\n- When entity_schema is LegalEntity/Organization/Company but the inline pattern clearly forms a person name, still apply the above person expansion and classify accordingly (full_name + aliases).\n- For legal entities, only apply inline alternate expansion when it is clearly a person-like token sequence. Do not produce speculative corporate-name alternates from parentheses that look descriptive or territorial.\n\nClassification rules\n1) full_name\n- Place in full_name any string that appears to be an official/registered name, a formal institutional name, or a clearly presented person name.\n- LegalEntity heuristics for full_name:\n  - Names containing or prefixed by an organizational/legal form/designator: JSC, PJSC, OJSC, AO, LLC, L.L.C., LLP, Ltd, Limited, Co., Company, PLC, AG, SA/S.A., GmbH, SAS, SARL, SpA/S.p.A., Bank, Joint-stock company/Joint-stock Company, etc.\n  - Formal public bodies and institutions (even without corporate designators) when clearly presented as proper names: “The Ministry of …”, “National Bank of …”, “State Committee on …”, “Department of …”, “Council of …”, “Agency for …”.\n  - Distinctive entity names presented as standalone entries (not introduced by aka/dba/t/a/fka) may be treated as full_name even if they lack a legal designator, when they look like a formal style (e.g., “Paraiba World”, “Trust Capital Investment”).\n- Person heuristics for full_name:\n  - If a candidate is a person name, include it as full_name exactly as presented. Preserve relationship/cultural markers as part of the name: S/O, D/O, W/O, A/L, A/P, BIN, BINTI, etc. Examples: “Manimegalai d/o VELLASAMY”, “Hari Kishen S/O BALAKRISHNAN”.\n  - If entity_schema is LegalEntity/Organization/Company but the string clearly contains a person name, still include it as full_name.\n  - Multiple transliterations or scripts separated by allowed separators (e.g., “Бернд Бусеманн / Bernd Busemann”) should each be included as separate full_name entries.\n  - Single-token person names:\n    - A single-word that is clearly a surname or mononym (e.g., contains surname punctuation like O' or D', is presented in an all-caps surname style such as “O'KANE”) should be treated as full_name.\n    - A single-word that is only a generic given name without clear evidence of being a legal mononym should go to weak_alias (see weak_alias rules).\n- Important: When inline alternates are present for a person name, the base outside-parentheses form is the only full_name. All inline alternates become aliases via the expansion algorithm; do not add additional full_name entries unless alternates are presented as standalone names separated by top-level strong separators without any inline-parentheses context.\n\n2) alias\n- Use alias for alternative names that are clearly trade names, brand names, or “also known as” non-registered variants.\n- Route strings following labels (case-insensitive, punctuation-insensitive) like: aka, a.k.a., a/k/a, “also known as”, dba, d/b/a, “doing business as”, t/a, “trading as” to alias. Strip the label and any enclosing punctuation/parentheses; preserve the name as presented.\n- Do NOT move a formally styled name (e.g., starting with JSC/LLC/etc., or formal government body names) into alias unless it is explicitly labeled as aka/dba.\n- Person inline alternates: All permutations generated from inline alternates (see Special handling) belong to alias (except the base form, which is full_name).\n- Do NOT treat items introduced only by “including/this includes/as well as/…” as aliases.\n\n3) weak_alias\n- Use weak_alias for generic, truncated, or ambiguous short forms that are not reliable identifiers on their own, or partial names extracted from larger names.\n  - Examples: very generic bank names without qualifiers (“Universal Bank”), fragmentary or short forms, transliterations without organizational form when multiple plausible entities might match, or a single given name for a person.\n- Person-specific guidance: a single-word given name (e.g., “Elena”) without surname or qualifiers should generally be weak_alias, not full_name, unless the input explicitly indicates that mononym is the legal/official name.\n- Do NOT output partial inline alternate tokens (e.g., “KHODAKOVSKYY”) as weak_alias when they only appear as alternates inside parentheses; such partials should not be emitted at all unless the input also presents them as standalone names.\n\n4) previous_name\n- Capture former names indicated by metadata such as: “formerly”, “former”, “previously”, “prev.”, “fka”, “f/k/a”, “formerly known as”, “née”.\n- These may appear in parentheses or after such keywords, sometimes with stray commas or periods (e.g., “f.k.a., ”). Normalize by removing the keyword(s), surrounding punctuation/parentheses, and extract only the name, preserving its original casing/punctuation.\n  - Example: “BANK OF ANSHAN CO., LTD. (FORMERLY ANSHAN CITY COMMERCIAL BANK)” =>\n    - full_name: [\"BANK OF ANSHAN CO., LTD.\"]\n    - previous_name: [\"ANSHAN CITY COMMERCIAL BANK\"]\n\nAdditional parsing/labeling robustness\n- Treat label variants case-insensitively and tolerate punctuation/spacing variations: aka/a.k.a/a k a; fka/f.k.a/f k a; dba/d.b.a; t/a; “also known as”; “formerly known as”; “previously”.\n- Labels may appear inside parentheses or inline; remove labels and enclosing punctuation, route the following name(s) to the correct field.\n- Multiple aka/fka segments within a single string may be separated by semicolons or commas; split per the separator rules and route each accordingly.\n\nPrioritization and deduplication\n- Prefer classifying a candidate as full_name when it meets formal indicators (organizational form/designator, formal public body style, or clear person name including permitted mononyms/surnames).\n- When semicolon-separated entries are present without alias labels, treat each as a separate full_name candidate (e.g., both “Trust Capital Investment” and “Trust Holding Funds Ltd” become full_name).\n- Do not place the same string in multiple fields. If a string could be both full_name and alias, keep it only as full_name.\n- Deduplicate case-insensitively across all fields, preserving the first-seen original form.\n\nOrdering\n- Preserve the input order of names when populating lists. For alias permutations generated from inline alternates, use a stable, predictable order:\n  - First list alternates by varying one token at a time in reading order (e.g., alternate given name with base surname; then base given name with alternate surname(s) in the order listed).\n  - Then list cross-combinations where multiple tokens are alternated, respecting the original left-to-right order of alternates inside parentheses.\n  - Always exclude the base full_name from alias.\n\nConcrete, corrective examples (matched to the pitfalls)\n- Input: ['O&#39;KANE'] (any entity_schema)\n  - Output:\n    - full_name: [\"O'KANE\"]\n    - alias: []\n    - weak_alias: []\n    - previous_name: []\n- Input: ['Joint-stock bank \"City Invest Bank\"; AO \"City Invest Bank\"'] (Company)\n  - Output:\n    - full_name: ['Joint-stock bank \"City Invest Bank\"', 'AO \"City Invest Bank\"']\n    - alias: []\n    - weak_alias: []\n    - previous_name: []\n- Input: ['Yichang Testing Technology Research Institute a.k.a. Yichang Institute of Testing Technology'] (Organization)\n  - Output:\n    - full_name: ['Yichang Testing Technology Research Institute']\n    - alias: ['Yichang Institute of Testing Technology']\n    - weak_alias: []\n    - previous_name: []\n- Input: ['Aleksandr(Oleksandr) KHODAKOVSKY(KHODAKOVSKYY/KHODAKOVSKII)'] (LegalEntity)\n  - Output:\n    - full_name: ['Aleksandr KHODAKOVSKY']\n    - alias: ['Oleksandr KHODAKOVSKY', 'Aleksandr KHODAKOVSKYY', 'Oleksandr KHODAKOVSKYY', 'Aleksandr KHODAKOVSKII', 'Oleksandr KHODAKOVSKII']\n    - weak_alias: []\n    - previous_name: []\n  - Notes: Base outside-parentheses form is the sole full_name. All inline alternates are aliases. Do not output bare “KHODAKOVSKYY/KHODAKOVSKII”.\n- Input: ['Trust Capital Investment; Trust Holding Funds Ltd'] (LegalEntity)\n  - Output:\n    - full_name: ['Trust Capital Investment', 'Trust Holding Funds Ltd']\n    - alias: []\n    - weak_alias: []\n    - previous_name: []\n  - Notes: Both semicolon-separated items are standalone formal names; do not demote to weak_alias.\n- Input: ['Igor(Ihor) KAKIDZYANOV(KAKIZYANOV/KAKIDZHANOV)'] (Person)\n  - Output:\n    - full_name: ['Igor KAKIDZYANOV']\n    - alias: ['Ihor KAKIDZYANOV', 'Igor KAKIZYANOV', 'Ihor KAKIZYANOV', 'Igor KAKIDZHANOV', 'Ihor KAKIDZHANOV']\n    - weak_alias: []\n    - previous_name: []\n  - Notes: Generate all name permutations using inline alternates; do not emit partial tokens.",
    "fields": [
      {
        "prefix": "Entity Schema:",
        "description": "The schema denotes the type of entity. Both Persons and Organizations are specialisation of LegalEntity. Company is a specialisation of Organization. Everything extends Thing."
      },
      {
        "prefix": "Strings:",
        "description": "A list of raw name strings to be cleaned and categorised. Each string might contain multiple names."
      },
      {
        "prefix": "Full Name:",
        "description": "A list of the names of this entity, potentially in various languages and transliterations."
      },
      {
        "prefix": "Alias:",
        "description": "A list of alternative but still fully descriptive names for this entity."
      },
      {
        "prefix": "Weak Alias:",
        "description": "A list of names with low confidence or a very low degree of uniqueness in the context of legal entity names. Includes clear nicknames with no similarity to the full name."
      },
      {
        "prefix": "Previous Name:",
        "description": "A list of names this entity was known by in the past."
      }
    ]
  },
  "lm": null,
  "metadata": {
    "dependency_versions": {
      "python": "3.13",
      "dspy": "3.0.3",
      "cloudpickle": "3.1"
    }
  }
}
