{
  "traces": [],
  "train": [],
  "demos": [],
  "signature": {
    "instructions": "Name extraction and categorization – instructions\n\nObjective\n- Extract and categorize names from a single input string. Preserve the exact text of names while removing only true non-name noise. Handle both person and organization names, including multilingual forms and explicit aliases/previous names.\n\nInput\n- One field: string\n\nOutput\n- Return exactly an object with four fields, each a list of strings:\n  - full_name\n  - alias\n  - weak_alias\n  - previous_name\n- Use empty lists when nothing is found. Do not include nulls.\n\nGlobal normalization\n- Preserve original casing exactly. Do not title-case or change case.\n- Preserve punctuation that is part of the name (e.g., commas in “Last, First”, legal entity punctuation like “Co., Ltd.”).\n- Collapse multiple internal spaces to a single space.\n- Trim leading/trailing spaces.\n- Trim leading/trailing delimiter or marker punctuation that is not part of the name (e.g., stray commas, semicolons, slashes around a name).\n- Deduplicate across and within lists using exact string match after trimming/collapsing spaces. If a name is already in full_name, do not repeat it in alias/weak_alias/previous_name.\n\nSegmentation and labels\n- Primary segment delimiters: semicolons “;” or “；”, pipes “|”, and newlines. Split the input into segments on these separators.\n- Remove non-name section labels that introduce a name with a colon-like delimiter (ASCII \":\" or full-width \"：\"). Examples (non-exhaustive):\n  - “简体中文：”, “繁體中文：”, “中文：”, “Chinese:”, “English:”, “Name in Chinese:”, “in Chinese:”, “Russian:”, etc.\n  - After removing the label, the remaining text in that segment is the name text.\n- If multiple such labeled segments appear without alias/previous markers tying them together, treat each resulting name as a separate full_name.\n  - Example: “WANG, Zhiqing; 简体中文：王志清” -> full_name: [\"WANG, Zhiqing\", \"王志清\"].\n\nTop-level slash handling\n- Do NOT treat slashes as general segment delimiters inside a single person/organization name.\n- Treat a slash “/” as a delimiter between distinct full names only when ALL of the following hold:\n  - The slash is top-level (not inside parentheses/brackets).\n  - It is surrounded by optional spaces and separates two strings that each look like a complete name (e.g., each side contains letters from any script and typically at least one space or is a recognizable single-token name).\n  - There are no alias/previous markers tying the two sides together.\n- In that case, output each side as a separate full_name. Example: “Анналена Баербоцк / Annalena Baerbock” -> full_name: [\"Анналена Баербоцк\", \"Annalena Baerbock\"].\n- Do not split on slashes that are part of alias markers (“a/k/a”, “d/b/a”, etc.) or integral constructs (e.g., “A/Prof”, Malaysian “A/L”, “A/P”).\n\nMarkers and categorization\n- Alias markers -> alias (case-insensitive; ignore optional punctuation immediately after the marker):\n  - \"alias\", \"alias:\", \"aka\", \"aka:\", \"a.k.a.\", \"a/k/a\", \"also known as\", \"d/b/a\", \"doing business as\", \"t/a\", \"trading as\"\n- Previous-name markers -> previous_name (case-insensitive; ignore optional punctuation immediately after the marker):\n  - \"formerly known as\", \"f/k/a\", \"fka\", \"previously known as\", \"p/k/a\"\n- Treat \"n/k/a\" (now known as) as an alias of the former name to the current if both are explicitly present; otherwise, do not infer.\n- If a marker appears with no following name (e.g., “aka,” at end), add nothing for that marker.\n\nWhat to extract\n- full_name:\n  - The primary name(s) present in each segment before any alias/previous-name markers in that segment.\n  - If the string contains multiple distinct names in different languages/scripts or in separate label-based sections, treat each such name as a separate full_name.\n  - Preserve commas in names, including “Last, First” formatting (e.g., “WANG, Zhiqing”) and commas within legal names (“Co., Ltd.”).\n  - Parenthetical qualifiers that are part of an organization’s legal name (e.g., locations/divisions) must be preserved as part of the full_name (e.g., “AccoTest Technology Co., Ltd. (Hong Kong)”).\n  - Remove non-name noise (see below), such as person titles, credentials, and descriptors.\n\n- alias:\n  - Alternative names explicitly indicated by alias markers.\n  - Trade styles (“d/b/a”, “t/a”, “trading as”): capture only the trade name text; do not append legal entity suffixes or external tokens unless they are explicitly inside the alias text.\n  - Parenthetical aliases with markers inside a person name: remove the marker words and use the content as the alias core; append clearly shared external person-name components to form a complete alias.\n    - Example: “PEARL (A.K.A. NEI-CHIEN CHU) LI” -> full_name: “PEARL LI”; alias: “NEI-CHIEN CHU LI”.\n  - Parenthetical or slash-delimited variant components without explicit alias markers (persons only):\n    - If a person name includes a parenthetical/bracketed component immediately adjacent to a name part (e.g., given name or surname) and that component contains alternative spellings/transliterations (e.g., “(Kateryna)”, “（HUBARIEVA/HUBAREVA）”), treat those alternatives as aliases.\n    - Expand alternatives to complete person names by combining each variant with the unchanged parts of the name that are outside the parentheses.\n    - Generate all combinations when multiple variant groups exist.\n    - Do not output isolated components (e.g., do not output just “HUBARIEVA”). Always output complete names.\n\n- previous_name:\n  - Former names explicitly indicated by previous-name markers.\n\n- weak_alias:\n  - Person nicknames or informal/short variants explicitly indicated (e.g., marked as “nickname”, or quoted nicknames within a name).\n    - For quoted nicknames inside a name (e.g., Joe “Bud” Smith), add the nickname without the quotes to weak_alias (“Bud”) and do not include the quoted nickname text in full_name.\n  - Organization acronyms/initialisms presented in parentheses immediately following the organization name:\n    - If the parenthetical content is a likely acronym/initialism (typically 2–10 uppercase letters/numbers, optionally with periods and no spaces), remove the parenthetical from full_name and add the acronym to weak_alias.\n    - If the parenthetical content is a location, division, or other substantive legal qualifier rather than an acronym, keep it as part of full_name and do not add anything to weak_alias.\n\nNon-name noise to remove\n- Remove clearly non-name descriptors adjacent to a name, especially in parentheses or following commas, when they are not part of the legal or personal name and are not alias/previous markers. Examples (non-exhaustive):\n  - Nationality/country/role/status descriptors: “(DPRK individual)”, “(Russian national)”, “(entity)”, “(person)”, “(company)”, “(firm)”, “(sanctioned)”, “(designated)”, “(blacklisted)”.\n  - IDs/dates/metadata: “(DOB 1985)”, “(ID: 123456)”, “(Passport No. …)”.\n  - Person titles/honorifics/positions and academic/professional designations when they are not integral to the name:\n    - Remove if they appear before or after a person’s name or after a comma.\n    - Examples to remove: “Mr”, “Ms”, “Mrs”, “Miss”, “Mx”, “Dr”, “Prof”, “Professor”, “Associate Professor”, “Assistant Professor”, “Adjunct”, “A/Prof”, “Sir”, “Dame”, “Hon.”, “Honorable”, “H.E.”, “Amb”, “Ambassador”, military/police ranks (e.g., “Capt.”, “Col.”, “Gen.”, “Lt.”), job roles (e.g., “CEO”, “Director”, “Chairman”, “Minister”, “Judge”, “Justice”, “Sen.”, “MP”).\n    - Remove academic/professional credentials after a name: “PhD”, “Ph.D.”, “M.D.”, “MD”, “CPA”, “Esq.”, “QC”, “SC”.\n    - Preserve generational suffixes that are part of a person’s name: “Jr.”, “Sr.”, “II”, “III”, “IV”.\n- Do not remove legal entity suffixes or punctuation that are part of an organization name (e.g., “Ltd.”, “Co., Ltd.”, “Inc.”, “LLC”, “LLP”, “GmbH”, “S.A.”, “SARL”, “Pvt Ltd”, etc.).\n\nDelimiter and character handling\n- Replace delimiter punctuation used between parts of a single person name only when it’s clearly a non-name delimiter and not integral to the name. Example: “AMIR; RAHIMI alias:” -> full_name: [\"AMIR RAHIMI\"]; alias: [] (no alias text follows).\n- Preserve characters commonly used within names:\n  - Hyphens, apostrophes, periods in initials/abbreviations, ampersands (&), commas, diacritics.\n- Slashes:\n  - Preserve integral slashes in name constructs (e.g., Malaysian patronymics “A/L”, “A/P”, titles like “A/Prof”).\n  - Treat slashes as alternative separators only when they clearly enumerate alternative person-name components within parentheses/brackets (split those into alternatives only in that context).\n  - Do not split on slashes that are part of alias markers (“a/k/a”, “d/b/a”, etc.).\n\nParenthetical handling summary\n- With alias markers inside parentheses in a person name:\n  - Remove marker words, use the content as alias core, and append shared outside person components to complete the alias.\n- Without alias markers in a person name:\n  - If parentheses/brackets immediately follow or are embedded in a person name token and contain alternative spellings/transliterations (possibly slash-separated), treat contents as aliases; expand to complete names; generate all combinations across variant groups.\n  - Do not output incomplete fragments.\n- Organizations:\n  - Parentheticals without alias/previous markers that are locations/divisions or similar legal qualifiers remain in full_name.\n  - Parentheticals that are standalone acronyms/initialisms (e.g., “(JNECR)”) should be removed from full_name and captured in weak_alias.\n\nDo not infer or fabricate\n- Do not create aliases or weak_aliases by shortening, truncating, removing suffixes, or dropping parentheticals unless explicitly provided as aliases/nicknames, as acronym-in-parentheses for organizations, or by clear parenthetical/slash alternative notation for person names.\n- Do not reorder name components. Preserve the original order after cleaning delimiters.\n- Do not guess whether a token is a location vs part of the legal name; keep it as-is with the name, except for the explicit acronym-in-parentheses-to-weak_alias rule for organizations.\n\nMultiple names\n- If multiple distinct names are present (separated by semicolons/“；”, pipes “|”, newlines, top-level bilingual slashes “/”, or introduced by non-name labels like “简体中文：”), and there are no alias/previous markers tying them together, place each as a separate full_name.\n\nStep-by-step procedure\n1) Normalize whitespace; trim the whole string.\n2) Split into segments on “;”, “；”, “|”, and newlines. For each segment:\n   a. Trim; collapse internal spaces.\n   b. Remove and discard leading language/info labels ending with “:” or “：”.\n   c. Detect explicit alias/previous markers; split the segment into:\n      - Primary name part (before the first marker)\n      - Following marker-name pairs (may be multiple)\n   d. Clean the primary name:\n      - Remove person titles/honorifics/positions and credentials as described above.\n      - Remove non-name descriptors (nationality/status/IDs/dates) typically in parentheses or after commas.\n      - Preserve legal entity suffixes and commas that belong to the name.\n      - For organizations: if immediately followed by a parenthetical acronym (2–10 uppercase letters/numbers, optional periods, no spaces), move that acronym to weak_alias and remove the parenthetical from full_name.\n   e. Handle person parenthetical variants:\n      - If the primary person name has parenthetical/bracketed variant components directly attached to a name token, generate alias combinations by replacing only the variant token(s). Keep the unannotated full form as full_name; all variants go to alias.\n      - Remove quoted nicknames from full_name and add the nickname (without quotes) to weak_alias.\n   f. Handle top-level bilingual slash between two full names if criteria met; otherwise preserve slashes as part of the name.\n   g. Add the cleaned primary name to full_name if non-empty.\n   h. For each detected alias marker, extract the following name text (cleaned with the same rules as appropriate) and add to alias. For trade styles (“d/b/a”, “t/a”, etc.), capture only the trade name text.\n   i. For each detected previous-name marker, extract the following name text (cleaned) and add to previous_name.\n3) Post-process:\n   - If a segment shows an obvious single person name split by a non-name delimiter (e.g., “AMIR; RAHIMI” with no other content), merge into “AMIR RAHIMI”.\n   - Apply deduplication across all lists; do not repeat names from full_name in alias/weak_alias/previous_name.\n   - Ensure outputs are lists; use [] when nothing found.\n\nWorked examples\n- “Yichang Testing Technology Research Institute a.k.a. Yichang Institute of Testing Technology”\n  - full_name: [\"Yichang Testing Technology Research Institute\"]\n  - alias: [\"Yichang Institute of Testing Technology\"]\n  - weak_alias: []\n  - previous_name: []\n- “Adjunct A/Prof Png Gek Kheng”\n  - Remove titles “Adjunct” and “A/Prof”.\n  - full_name: [\"Png Gek Kheng\"]\n  - alias: []\n  - weak_alias: []\n  - previous_name: []\n- “JP Finance; Jean Pierre Technologies LTD”\n  - full_name: [\"JP Finance\", \"Jean Pierre Technologies LTD\"]\n  - alias: []\n  - weak_alias: []\n  - previous_name: []\n\nOutput formatting\n- Return exactly:\n  - full_name: [ ... ]\n  - alias: [ ... ]\n  - weak_alias: [ ... ]\n  - previous_name: [ ... ]\n- Ensure each string is trimmed, with collapsed spaces, and free of leading/trailing non-name delimiters and marker words (e.g., remove the literal \"alias:\", \"aka\", \"f/k/a\" tokens and adjacent punctuation before storing).",
    "fields": [
      {
        "prefix": "String:",
        "description": "${string}"
      },
      {
        "prefix": "Full Name:",
        "description": "A list of the names of this entity, potentially in various languages and transliterations."
      },
      {
        "prefix": "Alias:",
        "description": "A list of alternative names or nicknames for this entity."
      },
      {
        "prefix": "Weak Alias:",
        "description": "A list of names with low confidence or a very low degree of uniqueness in the context of legal entity names."
      },
      {
        "prefix": "Previous Name:",
        "description": "A list of names this entity was known by in the past."
      }
    ]
  },
  "lm": null,
  "metadata": {
    "dependency_versions": {
      "python": "3.12",
      "dspy": "3.0.3",
      "cloudpickle": "3.1"
    }
  }
}
